; パスカルの三角形のn行m列の要素を計算する
;     0   1   2   3   4   m列
; 0   1   1   1   1   1
; 1   1   2   3   4   5
; 2   1   3   6   10  15
; 3   1   4   10  20  35
; 4   1   5   15  35  70
; n行
(define 
  (f n m)
  (if (or (<= n 0) (<= m 0)) 
    1
    (+ 
      (f n (- m 1))
      (f (- n 1) m)
    )
  )
)

(print (f 0 0) "\t" (f 0 1) "\t" (f 0 2) "\t" (f 0 3) "\t" (f 0 4))
(print (f 1 0) "\t" (f 1 1) "\t" (f 1 2) "\t" (f 1 3) "\t" (f 1 4))
(print (f 2 0) "\t" (f 2 1) "\t" (f 2 2) "\t" (f 2 3) "\t" (f 2 4))
(print (f 3 0) "\t" (f 3 1) "\t" (f 3 2) "\t" (f 3 3) "\t" (f 3 4))
(print (f 4 0) "\t" (f 4 1) "\t" (f 4 2) "\t" (f 4 3) "\t" (f 4 4))
